/* Main program */ 
list.1 = 0 
list.2 = 0 
list.3 = 0 

/* Assigning new values to the array*/ 
list.1 = 10 
list.3 = 30 
say list.1 
say list.2 
say list.3 

/*Copying arrays*/
listnew. = list. 

say listnew.1 
say listnew.2 
say listnew.3 

/*iterate through the array*/
number_of_elements = 3 
do j = 1 to number_of_elements 
say list.j 
end 