/* Main program */ 
do 5 
   say "hello" /* Prints hello 5 times */
end 

/* Main program */ 
do i = 0 to 5 by 2 /*start end hop*/
   say "hello" 
end 