/* Main Program */
SAY 'ENTER THE FIRST NUMBER:' 
PULL NUMBER1
SAY 'ENTER THE SECOND NUMBER:' 
PULL NUMBER2
SAY 'ENTER THE THIRD NUMBER:' 
PULL NUMBER3
GREAT = VALUES(NUMBER1,NUMBER2,NUMBER3)
SAY 'GREATEST NUMBER IS:' GREAT
EXIT 0

VALUES:
PARSE ARG NUMBER1 NUMBER2 NUMBER3
IF NUMBER1 > NUMBER2 THEN
    IF NUMBER1 > NUMBER3 THEN
        XE=NUMBER1
    ELSE
        XE=NUMBER3
ELSE
    IF NUMBER2 > NUMBER3 THEN
        XE=NUMBER2
    ELSE
        XE=NUMBER3
RETURN XE /* If Else Demo*/