/* Main program */ 
i = 50.5 
j = -40.4 
say ABS(i) 
say ABS(j) 
say MAX(10,20,30)
say MIN(10,20,30)
say RANDOM()
/*
Returns 1 if number is greater than 0, or 0 if the number is 0, or -1 if the number is less than 0.
i − This the input number for which the sign needs to be determined.
*/
say SIGN(12) 
say SIGN(-12) 

say TRUNC(12.22) /*Returns 12*/