/* Main Program */

 SAY 'Please enter a number.'
 PULL number1
 SAY 'Now enter a number to add to the first number.'
 PULL number2
 sum = number1 + number2
 SAY 'The sum of the two numbers is' number1+number2 '.'