/* Main Program */

SAY "Enter name: "
PARSE UPPER PULL name /**/

SAY "Name is " name

PULL num1 num2

num=num1+num2

SAY "Sum of" num1 "and " num2 "" num

/* Providing the arguments*/
ARG number1, number2
Sum = number1 + number2
Say 'Sum of two numbers is ' Sum